#+title: Org-mode

* Org

#+begin_src emacs-lisp
  (defvar org-directory "~/org")
  (use-package org
    :config
    (org-indent-mode 1)
    (add-to-list 'org-babel-default-header-args
                 '(:mkdirp . "yes"))
    (org-babel-do-load-languages 'org-babel-load-languages
                                 '((emacs-lisp . t)
                                   (shell      . t)))
    (defun actuator-update-all-dynamic-blocks ()
      "Hi"
      (org-dblock-update 1))
    (add-hook 'org-mode-hook
              (lambda ()
                (add-hook 'before-save-hook
                          'actuator-update-all-dynamic-blocks nil
                          'make-it-local)))
    (add-to-list 'org-default-properties "DIR")
    (add-to-list 'org-default-properties "header-args")
    :bind
    ("C-c c" . counsel-org-capture)
    ("C-c a" . org-agenda)
    ("C-c l" . org-store-link)
    :custom
    (org-display-custom-times t)
    (org-time-stamp-custom-formats
     '("<%A, %B %e %Y>" . "<%A, %B %e %Y %H:%M>"))
    (org-startup-folded 'content)
    (org-ellipsis "→")
    (org-startup-align-all-tables t)
    (org-startup-shrink-all-tables t)
    (org-startup-with-inline-images t)
    (org-startup-indented t)
    (org-hide-leading-stars t)
    (org-pretty-entities-include-sub-superscripts t)
    (org-hide-emphasis-markers t)
    (org-image-actual-width 300)
    (org-fontify-done-headline t)
    (org-structure-template-alist '(("e" . "src emacs-lisp")
                                    ("s" . "src shell")))
    (org-log-done 'time)
    (org-log-into-drawer t)
    (org-closed-keep-when-no-todo t)
    (org-enforce-todo-dependencies t)
    (org-enforce-todo-checkbox-dependencies t)
    (org-complete-tags-always-offer-all-agenda-tags nil)
    (org-clone-delete-id t)
    (org-tags-column -60)
    (org-catch-invisible-edits 'show-and-error)
    (org-insert-heading-respect-content t)
    (org-ctrl-k-protect-subtree t)
    (org-M-RET-may-split-line '((default . nil)))
    (org-special-ctrl-k t)
    (org-special-ctrl-a/e t)
    (org-blank-before-new-entry '((heading         . t)
                                  (plain-list-item . auto)))
    (org-use-property-inheritance t)
    (org-modules nil)
    (org-tag-persistent-alist '(("noexport")
                                ("ignore")
                                ("unpublished")
                                ("blog")
                                ("tbd")))
    :hook
    (org-mode . visual-line-mode))
#+end_src

#+results:
: org-store-link

#+begin_src emacs-lisp
  (setq org-agenda-files `(,org-directory
                           ,(if (getenv "XDG_CONFIG_HOME")
                                (getenv "XDG_CONFIG_HOME")
                              "~/.config")
                           ,user-emacs-directory))
#+end_src


#+begin_src emacs-lisp
  (use-package org-capture
    :config
    (defun actuator-org-capture-turn-off-header-line ()
    "Disable the header-line in a local mode.
  This is used to disable the help line in `org-capture' buffers as
  there's no variable that will do it."
    (setq-local header-line-format nil))
    :hook (org-capture-mode . actuator-org-capture-turn-off-header-line))
#+end_src

#+begin_src emacs-lisp
  (use-package org-list
    :custom
    (org-list-indent-offset 1))
#+end_src

#+begin_src emacs-lisp
  (use-package org-keys
    :custom
    (org-use-speed-commands t))
#+end_src

#+begin_src emacs-lisp
  (use-package org-refile
    :custom
    (org-refile-allow-creating-parent-nodes 'confirm)
    (org-outline-path-complete-in-steps nil)
    (org-refile-use-outline-path 'file)
    (org-refile-targets '((org-agenda-files :maxlevel . 3)))
    :hook
    (midnight-mode . org-refile-get-targets))
#+end_src

#+begin_src emacs-lisp
  (use-package org-src
    :config
    (defun actuator-org-src-line-wrap-setup ()
      "Set truncate-lines-mode in org-source-editing buffers."
      (setq-local truncate-lines t))
    :custom
    (org-edit-src-persistent-message nil)
    (org-src-tab-acts-natively t)
    (org-src-window-setup 'current-window)
    (org-src-ask-before-returning-to-edit-buffer nil)
    (org-src-fontify-natively t)
    :hook (org-src-mode . actuator-org-src-line-wrap-setup))
#+end_src

#+begin_src emacs-lisp
  (use-package org-footnote
    :custom
    (org-footnote-auto-adjust t)
    (org-footnote-define-inline t)
    (org-footnote-auto-label 'random))
#+end_src

#+begin_src emacs-lisp
  (use-package ob-core
    :custom
    (org-confirm-babel-evaluate nil)
    (org-babel-results-keyword "results"))
#+end_src

#+begin_src emacs-lisp
  (use-package org-crypt
    :init
    (require 'org-crypt)
    :config
    (org-crypt-use-before-save-magic)
    (add-to-list 'org-modules 'org-crypt)
    :custom
    (org-tags-exclude-from-inheritance (quote ("crypt")))
    (org-crypt-key nil))
#+end_src

#+begin_src emacs-lisp
  (use-package org-agenda
    :straight nil
    :custom
    (org-agenda-sticky t)
    (org-agenda-dim-blocked-tasks t))
#+end_src

#+begin_src emacs-lisp
  (use-package org-id
    :straight nil
    :custom
    (org-id-link-to-org-use-id nil)
    :hook (midnight-mode . org-id-update-id-locations))
#+end_src

#+results:
| org-id-update-id-locations | org-refile-get-targets | recentf-cleanup |

